tests/performance/results/Transaksi/TC02-B summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
[TC02-B] GET /login,200,2653,16,7133,1502.75,0.000%,4.29821,20.90,1.08,4979.0
[TC02-B] POST /login,200,5672,100,11650,2817.22,0.000%,4.01091,84.36,8.33,21537.0
[TC02-B] GET /transaksi (1000 User),200,2761,28,7134,1642.86,0.000%,3.99872,408.10,3.85,104506.0
TOTAL,600,3695,16,11650,2500.60,0.000%,11.94624,509.51,13.11,43674.0