tests/performance/results/Transaksi/TC02-C summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
[TC02-C] GET /login,250,9230,0,19608,5821.90,4.400%,5.14742,24.51,1.24,4876.2
[TC02-C] POST /login,250,20200,0,34239,10757.48,12.000%,3.78753,71.45,7.02,19317.8
[TC02-C] GET /transaksi (2000 User - SPIKE),250,7016,0,21034,5815.86,18.000%,3.51030,295.39,2.77,86170.5
TOTAL,750,12149,0,34239,9714.65,11.467%,10.23933,367.86,9.84,36788.2